In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

##  一、Groupby

数据一班经过data->split->apply->combine

分组键：
* 列表或数组，并和待分组的数据大小相同
* 字典或Series
* 待分组数据中的列名
* 函数

以上本质还是数组，只是有些需要系统隐含计算

In [2]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
   ....:                    'key2' : ['one', 'two', 'one', 'two', 'one'],
   ....:                    'data1' : np.random.randn(5),
   ....:                    'data2' : np.random.randn(5)})

In [25]:
grouped = df.groupby([df['key1'],'key2'],as_index = True)['data2']

In [13]:
def show_g(grouped):
    for g_name,g in grouped:
        print(g_name)
        print('--------')
        print(g)

In [16]:
show_g(grouped)

('a', 'one')
--------
      data1     data2 key1 key2
0  0.735176  1.374333    a  one
4  1.725440 -0.948508    a  one
('a', 'two')
--------
      data1     data2 key1 key2
1  0.228623  1.044565    a  two
('b', 'one')
--------
      data1     data2 key1 key2
2 -0.052236 -0.752713    b  one
('b', 'two')
--------
      data1     data2 key1 key2
3 -0.516593  0.287189    b  two

In [21]:
grouped

key1  key2
a     one     0.212912
      two     1.044565
b     one    -0.752713
      two     0.287189
Name: data2, dtype: float64

分组键可以是任何大小合适的数组

In [23]:
In [18]: states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])

In [19]: years = np.array([2005, 2005, 2006, 2005, 2006])
df.groupby([states,years]).sum()

                    data1     data2
California 2005  0.228623  1.044565
           2006 -0.052236 -0.752713
Ohio       2005  0.218584  1.661522
           2006  1.725440 -0.948508

#### 分组有一个size属性，能查看分组的大小

In [26]:
grouped.size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
Name: data2, dtype: int64

#### 分组可以迭代，如

In [27]:
pieces = dict(list(df.groupby('key1')))

In [29]:
pieces['b']

      data1     data2 key1 key2
2 -0.052236 -0.752713    b  one
3 -0.516593  0.287189    b  two

In [30]:
grouped2 = df.groupby(df.dtypes,axis = 1)

In [32]:
show_g(grouped2)

float64
--------
      data1     data2
0  0.735176  1.374333
1  0.228623  1.044565
2 -0.052236 -0.752713
3 -0.516593  0.287189
4  1.725440 -0.948508
object
--------
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

### 通过字典或Series进行分组

In [33]:
In [35]: people = pd.DataFrame(np.random.randn(5, 5),
   ....:                       columns=['a', 'b', 'c', 'd', 'e'],
   ....:                       index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [36]: people.iloc[2:3, [1, 2]] = np.nan # Add a few NA values

In [37]:
In [38]: mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
   ....:            'd': 'blue', 'e': 'red', 'f' : 'orange'}
grouped3 = people.groupby(mapping,axis = 1)

In [38]:
show_g(grouped3)

blue
--------
               c         d
Joe     0.083826 -0.869422
Steve  -0.264367 -0.026471
Wes          NaN  0.679625
Jim     0.040881 -0.353360
Travis  0.448126  0.264137
red
--------
               a         b         e
Joe     0.480109 -1.001699  0.301227
Steve   0.288716  0.078495 -0.288237
Wes     1.208960       NaN -0.239976
Jim     0.262119 -1.300908 -0.461105
Travis  0.148517 -0.817000 -0.035614

In [39]:
def mean_fill(g):
    return g.fillna(g.mean())

In [40]:
grouped3.apply(mean_fill)

               a         b         c         d         e
Joe     0.480109 -1.001699  0.083826 -0.869422  0.301227
Steve   0.288716  0.078495 -0.264367 -0.026471 -0.288237
Wes     1.208960 -0.760278  0.077116  0.679625 -0.239976
Jim     0.262119 -1.300908  0.040881 -0.353360 -0.461105
Travis  0.148517 -0.817000  0.448126  0.264137 -0.035614

In [41]:
 map_series = pd.Series(mapping)

In [43]:
people.groupby(map_series,axis = 1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

### 通过函数进行分组

In [48]:
grouped4 = people.groupby(lambda r:r[-1]=='s')

In [49]:
show_g(grouped4)

False
--------
              a         b         c         d         e
Joe    0.480109 -1.001699  0.083826 -0.869422  0.301227
Steve  0.288716  0.078495 -0.264367 -0.026471 -0.288237
Jim    0.262119 -1.300908  0.040881 -0.353360 -0.461105
True
--------
               a      b         c         d         e
Wes     1.208960    NaN       NaN  0.679625 -0.239976
Travis  0.148517 -0.817  0.448126  0.264137 -0.035614

### 根据索引级别分组

In [50]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
   ....:                                     [1, 3, 5, 1, 3]],
   ....:                                     names=['cty', 'tenor'])

hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)

In [51]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      0.736838  2.168126  0.367302 -0.602352  0.111880
1     -0.016865  0.805011  0.583153  0.216225 -0.315191
2     -0.599512 -1.406079  0.250684 -0.209960 -0.672722
3      0.360487  0.380572  0.017745 -0.852317  0.367634

In [56]:
hier_df.groupby(level = 'cty',axis = 1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

## 10.2 数据聚合

聚合指的是任何能够从数组产生标量值的数据转换过程。之前的例子已经用过一些，比如mean、count、min以及sum等。

In [58]:
#quantile是定义于Series上的函数
df.groupby('key1')['data1'].quantile(0.9)

key1
a    1.527388
b   -0.098671
Name: data1, dtype: float64

In [60]:
In [54]: def peak_to_peak(arr):
   ....:     return arr.max() - arr.min()
In [55]: grouped.agg(peak_to_peak)

key1  key2
a     one     2.322841
      two     0.000000
b     one     0.000000
      two     0.000000
Name: data2, dtype: float64

### 面向列的多函数应用

In [63]:
tips = pd.read_csv(r'..\pydata-book\examples\tips.csv')

In [64]:
tips.head()

   total_bill   tip smoker  day    time  size
0       16.99  1.01     No  Sun  Dinner     2
1       10.34  1.66     No  Sun  Dinner     3
2       21.01  3.50     No  Sun  Dinner     3
3       23.68  3.31     No  Sun  Dinner     2
4       24.59  3.61     No  Sun  Dinner     4

In [65]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [66]:
grouped5 = tips.groupby(['day', 'smoker'])

传入一组函数，是列表形式

In [69]:
grouped_tip = grouped5['tip']

In [71]:
grouped_tip.agg(['mean', 'std', peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      2.812500  0.898494          2.00
     Yes     2.714000  1.077668          3.73
Sat  No      3.102889  1.642088          8.00
     Yes     2.875476  1.630580          9.00
Sun  No      3.167895  1.224785          4.99
     Yes     3.516842  1.261151          5.00
Thur No      2.673778  1.282964          5.45
     Yes     3.030000  1.113491          3.00

In [72]:
grouped_pct = grouped5['tip_pct']

In [73]:
grouped_pct.agg([('foo', 'mean'), ('bar', np.std)])

                  foo       bar
day  smoker
Fri  No      0.151650  0.028123
     Yes     0.174783  0.051293
Sat  No      0.158048  0.039767
     Yes     0.147906  0.061375
Sun  No      0.160113  0.042347
     Yes     0.187250  0.154134
Thur No      0.160298  0.038774
     Yes     0.163863  0.039389

In [77]:
grouped5.agg({'tip' : np.max, 'size' :'sum'})

               tip  size
day  smoker
Fri  No       3.50     9
     Yes      4.73    31
Sat  No       9.00   115
     Yes     10.00   104
Sun  No       6.00   167
     Yes      6.50    49
Thur No       6.70   112
     Yes      5.00    40

## 10.3 apply：一般性的“拆分－应用－合并”

In [78]:
def top(df,n=6,column = 'tip_pct'):
    return df.sort_values(by=column)[-n:]

In [79]:
tips.groupby('smoker').apply(top)

            total_bill   tip smoker   day    time  size   tip_pct
smoker
No     6          8.77  2.00     No   Sun  Dinner     2  0.228050
       88        24.71  5.85     No  Thur   Lunch     2  0.236746
       185       20.69  5.00     No   Sun  Dinner     5  0.241663
       51        10.29  2.60     No   Sun  Dinner     2  0.252672
       149        7.51  2.00     No  Thur   Lunch     2  0.266312
       232       11.61  3.39     No   Sat  Dinner     2  0.291990
Yes    93        16.32  4.30    Yes   Fri  Dinner     2  0.263480
       109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

In [83]:
tips.sort_values(by = 'tip',ascending = False)[:5]

     total_bill    tip smoker   day    time  size   tip_pct
170       50.81  10.00    Yes   Sat  Dinner     3  0.196812
212       48.33   9.00     No   Sat  Dinner     4  0.186220
23        39.42   7.58     No   Sat  Dinner     4  0.192288
59        48.27   6.73     No   Sat  Dinner     4  0.139424
141       34.30   6.70     No  Thur   Lunch     6  0.195335

In [84]:
tips.groupby(['smoker', 'day']).apply(top, n=1, column='total_bill')

                 total_bill    tip smoker   day    time  size   tip_pct
smoker day
No     Fri  94        22.75   3.25     No   Fri  Dinner     2  0.142857
       Sat  212       48.33   9.00     No   Sat  Dinner     4  0.186220
       Sun  156       48.17   5.00     No   Sun  Dinner     6  0.103799
       Thur 142       41.19   5.00     No  Thur   Lunch     5  0.121389
Yes    Fri  95        40.17   4.73    Yes   Fri  Dinner     4  0.117750
       Sat  170       50.81  10.00    Yes   Sat  Dinner     3  0.196812
       Sun  182       45.35   3.50    Yes   Sun  Dinner     3  0.077178
       Thur 197       43.11   5.00    Yes  Thur   Lunch     4  0.115982

### 分位数和桶分析

cut,qcut

In [85]:
In [82]: frame = pd.DataFrame({'data1': np.random.randn(1000),
   ....:                       'data2': np.random.randn(1000)})

In [86]:
quantiles = pd.cut(frame['data1'],4)

In [89]:
quantiles.max()

Interval(1.706, 3.371, closed='right')

In [90]:
grouped8 = frame.groupby(quantiles).max()

In [91]:
grouped8

                     data1     data2
data1
(-3.296, -1.624] -1.625131  2.135428
(-1.624, 0.0408]  0.032523  3.183450
(0.0408, 1.706]   1.699524  3.060131
(1.706, 3.371]    3.371077  2.236401

In [99]:
def get_stats(group):
   ....:     return {'min': group.min(), 'max': group.max(),
   ....:             'count': group.count(), 'mean': group.mean()}

In [100]:
grouped8.apply(get_stats)

data1    {'min': -1.62513065575, 'count': 4, 'max': 3.3...
data2    {'min': 2.13542817572, 'count': 4, 'max': 3.18...
dtype: object

In [102]:
In [86]: grouped9 = frame.data2.groupby(quantiles)

In [87]: grouped9.apply(get_stats).unstack()

                  count       max      mean       min
data1
(-3.296, -1.624]   47.0  2.135428 -0.096578 -1.843799
(-1.624, 0.0408]  478.0  3.183450  0.049658 -2.559088
(0.0408, 1.706]   439.0  3.060131  0.004604 -3.824069
(1.706, 3.371]     36.0  2.236401 -0.194574 -1.710553

## 10.4 透视表和交叉表

透视表（pivot table）是各种电子表格程序和其他数据分析软件中一种常见的数据汇总工具。它根据一个或多个键对数据进行聚合，并根据行和列上的分组键将数据分配到各个矩形区域中。在Python和pandas中，可以通过本章所介绍的groupby功能以及（能够利用层次化索引的）重塑运算制作透视表。DataFrame有一个pivot_table方法，此外还有一个顶级的pandas.pivot_table函数。除能为groupby提供便利之外，pivot_table还可以添加分项小计，也叫做margins。

In [103]:
tips.pivot_table(index = ['day','smoker'])

                 size       tip   tip_pct  total_bill
day  smoker
Fri  No      2.250000  2.812500  0.151650   18.420000
     Yes     2.066667  2.714000  0.174783   16.813333
Sat  No      2.555556  3.102889  0.158048   19.661778
     Yes     2.476190  2.875476  0.147906   21.276667
Sun  No      2.929825  3.167895  0.160113   20.506667
     Yes     2.578947  3.516842  0.187250   24.120000
Thur No      2.488889  2.673778  0.160298   17.113111
     Yes     2.352941  3.030000  0.163863   19.190588

In [104]:
tips.pivot_table(['tip_pct', 'size'], index=['time', 'day'],
   .....:                  columns='smoker')

                 size             tip_pct
smoker             No       Yes        No       Yes
time   day
Dinner Fri   2.000000  2.222222  0.139622  0.165347
       Sat   2.555556  2.476190  0.158048  0.147906
       Sun   2.929825  2.578947  0.160113  0.187250
       Thur  2.000000       NaN  0.159744       NaN
Lunch  Fri   3.000000  1.833333  0.187735  0.188937
       Thur  2.500000  2.352941  0.160311  0.163863

In [105]:
tips.pivot_table('tip_pct', index=['time', 'smoker'], columns='day',
   .....:                  aggfunc=len, margins=True)

day             Fri   Sat   Sun  Thur    All
time   smoker
Dinner No       3.0  45.0  57.0   1.0  106.0
       Yes      9.0  42.0  19.0   NaN   70.0
Lunch  No       1.0   NaN   NaN  44.0   45.0
       Yes      6.0   NaN   NaN  17.0   23.0
All            19.0  87.0  76.0  62.0  244.0

In [108]:
tips.groupby(['smoker','time','day'])['tip_pct'].mean().unstack()

day                 Fri       Sat       Sun      Thur
smoker time
No     Dinner  0.139622  0.158048  0.160113  0.159744
       Lunch   0.187735       NaN       NaN  0.160311
Yes    Dinner  0.165347  0.147906  0.187250       NaN
       Lunch   0.188937       NaN       NaN  0.163863

### 交叉表：crosstab

交叉表比透视表方便，是用于计算频率的

In [109]:
In [140]: pd.crosstab([tips.time, tips.day], tips.smoker, margins=True)

smoker        No  Yes  All
time   day
Dinner Fri     3    9   12
       Sat    45   42   87
       Sun    57   19   76
       Thur    1    0    1
Lunch  Fri     1    6    7
       Thur   44   17   61
All          151   93  244